app/controllers/kittens_controller.rb

INSERT INTO "kittens" ("name", "age", "cuteness", "softness", "created_at", "updated_at") VALUES ('Bartholo-mew', 2, 10, 7, '2025-07-13 22:35:27.307322', '2025-07-13 22:35:27.307322') RETURNING "id"
---
  def create
    @kitten = Kitten.new(kitten_params)
    return unless @kitten.save

SELECT "kittens".* FROM "kittens"
---
  def index
    @kittens = Kitten.all

UPDATE "kittens" SET "name" = 'Meow-Thusaleh', "age" = 0, "cuteness" = 1, "softness" = 1, "updated_at" = '2025-07-13 23:05:00.910335' WHERE "kittens"."id" = 3
---
  def update
    if @kitten.update(kitten_params)

DELETE FROM "kittens" WHERE "kittens"."id" = 2
---
  def destroy
    Kitten.destroy(params[:id])

SELECT "kittens".* FROM "kittens" WHERE "kittens"."id" = 1 LIMIT 1
---
  def find_kitten
    @kitten = Kitten.find(params[:id])